## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:38" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:38" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 38 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-cpfValidation will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-cpfValidation" {
      ~ etag                   = "6b37f8b0bc9fdf8b1860a5ea667850b5-5" -> "33197d2b5c1fd56ba250eb5e465a0c4b"
        id                     = "cpfValidation.33197d2b5c1fd56ba250eb5e465a0c4b.zip"
        tags                   = {}
      ~ version_id             = "Q0MUsCHR7em2jzoJtmyIkvrcFBP4Bc36" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-excelToJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-excelToJson" {
      ~ etag                   = "609a397e9343c863307b70227cbb2c9a-6" -> "a353743c6db71a81967ec6cbdfe9b209"
        id                     = "excelToJson.a353743c6db71a81967ec6cbdfe9b209.zip"
        tags                   = {}
      ~ version_id             = "u0siJRXv.3jPYMnkYs9JEranb5KyEZHx" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "94abbf867d1100053e263aafecd16d2a-6" -> "0615f8b46e5bb166eace878a4b050ccb"
        id                     = "graphql.0615f8b46e5bb166eace878a4b050ccb.zip"
        tags                   = {}
      ~ version_id             = "BuQvQkQEqIbahB74UJOMvQ6P9L45tOHW" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7047339dad89765a9cb8b7bbe2851038" -> "0a1b65b0ab03b30f96d554718b7f0977"
        id                     = "dist/200.html"
      ~ source_hash            = "7047339dad89765a9cb8b7bbe2851038" -> "0a1b65b0ab03b30f96d554718b7f0977"
        tags                   = {}
      ~ version_id             = "xpG9XtEqOC8_sbl9GdxvfAw_zeT.3hef" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "454bb7b792c0f6d5875deb5e7d81e0cc" -> "3b0fa3c8bd1e13279d45291c6d805bdc"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "454bb7b792c0f6d5875deb5e7d81e0cc" -> "3b0fa3c8bd1e13279d45291c6d805bdc"
        tags                   = {}
      ~ version_id             = "dsjm0XywCbI5r0N6DdD714Xm4c9Hoo1f" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "9dee41185cb83027bdcac60034eddd41" -> "0866f3f7bb8c24652d319c0cda36de9f"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "9dee41185cb83027bdcac60034eddd41" -> "0866f3f7bb8c24652d319c0cda36de9f"
        tags                   = {}
      ~ version_id             = "Oes9.2GjtLJuFHMTyCDz7A.ASpSup0DV" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "7047339dad89765a9cb8b7bbe2851038" -> "0a1b65b0ab03b30f96d554718b7f0977"
        id                     = "dist/index.html"
      ~ source_hash            = "7047339dad89765a9cb8b7bbe2851038" -> "0a1b65b0ab03b30f96d554718b7f0977"
        tags                   = {}
      ~ version_id             = "GxhwkUGneEQI1qK_.7Ek1BrWXsJQzR_r" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.3ff31ad8.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6e12896acbe49a77c2814aca9a19d514"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.3ff31ad8.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.3ff31ad8.js"
+       source_hash            = "6e12896acbe49a77c2814aca9a19d514"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.3ff31ad8.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "1b85afb29451caa76c58431be24fd636"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.3ff31ad8.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.3ff31ad8.js.LICENSE.txt"
+       source_hash            = "1b85afb29451caa76c58431be24fd636"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a0132a4a.js"] will be destroyed
  # (because key ["static/js/app.a0132a4a.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "4425213902130b49a41a6e88ff494863" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a0132a4a.js" -> null
-       key                    = "dist/static/js/app.a0132a4a.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a0132a4a.js" -> null
-       source_hash            = "4425213902130b49a41a6e88ff494863" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "yZYjAO.AdZrmf61PZgAgP0aJK7pkWbUE" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.a0132a4a.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.a0132a4a.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "1b85afb29451caa76c58431be24fd636" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.a0132a4a.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.a0132a4a.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.a0132a4a.js.LICENSE.txt" -> null
-       source_hash            = "1b85afb29451caa76c58431be24fd636" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "NcEoYTPYrtO6cDdT0LLUXDkRKNG1Ka7l" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:7/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
              ~ "DD_TAGS"                      = "git.commit.sha:410dc5d6029f544fda5f60d6920ae80b8394d431,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:85279a74bf193958782a41681d8b10604954192d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-excelToJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:7" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-excelToJson:7/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "7" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
              ~ "DD_TAGS"                      = "git.commit.sha:410dc5d6029f544fda5f60d6920ae80b8394d431,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:85279a74bf193958782a41681d8b10604954192d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
                # (13 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function-excelToJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "7" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:54" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:54/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "54" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
              ~ "DD_TAGS"                            = "git.commit.sha:410dc5d6029f544fda5f60d6920ae80b8394d431,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:85279a74bf193958782a41681d8b10604954192d,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "410dc5d6029f544fda5f60d6920ae80b8394d431" -> "85279a74bf193958782a41681d8b10604954192d"
                # (17 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "54" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 6 to add, 11 to change, 6 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7560528502)*